Revit 2027 API
CoordinationModelLinkUtils.IsCoordinationModelType Method
 Checks whether an element is a Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCoordinationModelType(
	Document document,
	Element coordinationModelType
)
Public Shared Function IsCoordinationModelType (
	document As Document,
	coordinationModelType As Element
) As Boolean
public:
static bool IsCoordinationModelType(
	Document^ document,
	Element^ coordinationModelType
)
static member IsCoordinationModelType :
        document : Document *
        coordinationModelType : Element -> bool
Parameters
document Document
 The document.
coordinationModelType Element
 The element to check.
Return Value
Boolean
 True if the element is Coordination Model type; false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace